### [ 데이터 전처리 - 결측치 치환 ]
- 결측치 (Missing Value)
    * 데이터/값이 존재하지 않는 것
- 결측치 체크
    * isna() : 결측치 여부에 따라 True/False 반환
- 결측치 처리
    * 삭제 : dropna()
    * 치환 : fillna()

[1] 모듈 로딩 및 데이터 준비 <hr>

In [1]:
## 모듈 로딩
import pandas as pd
import numpy as np          # 결측치 표기 np.nan

## DF 생성
df = pd.DataFrame( {'age'   : [ 5, 6, np.nan ],
                    'born'  : [ pd.NaT, pd.Timestamp('1939-05-27'), pd.Timestamp('1940-04-25')],
                    'name'  : ['Alfred', 'Batman', ''],
                    'toy'   : [None, 'Batmobile', 'Joker']})

## DF 출력
display(df, df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     2 non-null      float64
 1   born    2 non-null      datetime64[ns]
 2   name    3 non-null      object
 3   toy     2 non-null      object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 228.0+ bytes

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

None

[2] 결측치 체크 : isna() / isnull() <hr>

In [2]:
## 결측치 체크
display( df.info() )

## True => 1, False => 0 : 계산 진행
print(f'컬럼별 결측치 수 \n{df.isna().sum()}')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     2 non-null      float64
 1   born    2 non-null      datetime64[ns]
 2   name    3 non-null      object
 3   toy     2 non-null      object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 228.0+ bytes

None

컬럼별 결측치 수
age     1
born    1
name    0
toy     1
dtype: int64

[3] 결측치 치환 : fillna() <hr>

In [3]:
## -----------------------------------------------------------------
## 최환값 : 모든 결측치에 동일한 값 설정 / 모든 컬럼이 동일한 타입일 경우
## -----------------------------------------------------------------
df.fillna(-1)

   age                 born    name        toy
0  5.0                   -1  Alfred         -1
1  6.0  1939-05-27 00:00:00  Batman  Batmobile
2 -1.0  1940-04-25 00:00:00              Joker

In [4]:
## -----------------------------------------------------------------
## 최환값 : 컬럼별로 다른 결측치
## -----------------------------------------------------------------
df.fillna({'age':0, 'born':'미입력', 'toy':'없음'})

   age                 born    name        toy
0  5.0                  미입력  Alfred         없음
1  6.0  1939-05-27 00:00:00  Batman  Batmobile
2  0.0  1940-04-25 00:00:00              Joker

In [ ]:
## -----------------------------------------------------------------
## 최환값 : 컬럼별로 다른 결측치
## -----------------------------------------------------------------
age_mean = df['age'].mean()         # df['age'].median()
born_mode = df['born'].mode()[0]    # 최빈값
toy_mode = df['toy'].mode()[0]

df.fillna({'age':age_mean, 'born':born_mode, 'toy':toy_mode})

   age       born    name        toy
0  5.0 1939-05-27  Alfred  Batmobile
1  6.0 1939-05-27  Batman  Batmobile
2  5.5 1940-04-25              Joker

In [ ]:
## -----------------------------------------------------------------
## 최환값 : 이전값/이후값
## -----------------------------------------------------------------
## 이전행 값
# df.fillna(method='ffill')
display("이전 행 값", df.ffill()) ## 이전 행 값으로 채우겠다

# df.fillna(method='bfill')
display("다음 행 값", df.bfill()) ## 다음 행 값으로 채우겠다

'이전 행 값'

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  6.0 1940-04-25              Joker

'다음 행 값'

   age       born    name        toy
0  5.0 1939-05-27  Alfred  Batmobile
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker